import React from 'react'
import { View, Text, StyleSheet } from 'react-native'
export const VipIconImg = [
    require('./../../../images/user/vip/vip1.png'),
    require('./../../../images/user/vip/vip2.png'),
    require('./../../../images/user/vip/vip3.png'),
    require('./../../../images/user/vip/vip4.png'),
    require('./../../../images/user/vip/vip5.png'),
    require('./../../../images/user/vip/vip6.png'),
    require('./../../../images/user/vip/vip7.png'),
    require('./../../../images/user/vip/vip8.png'),
    require('./../../../images/user/vip/vip9.png'),
    require('./../../../images/user/vip/vip10.png')
]

export const VipBanners = [
    {
        img: require('./../../../images/user/vip/vipBanner.png')
    }
]

export const VipOverviewBanner = [
    {
        img: require('./../../../images/user/vip/VipOverviewBanner1.png')
    }
]

export const VipDetailsTitleInfor1 = [`อีสปอร์ต / กีฬา${'\n'}(รายวัน)”`, `คาสิโนสด${'\n'}(รายสัปดาห์)`, `เกม 3 มิติ${'\n'}(รายวัน)`, `สล็อต${'\n'}(รายวัน)`]
export const VipDetailsTitleInfor2 = Array.from({ length: VipDetailsTitleInfor1.length }, v => ['อัตราโบนัส', `ยอดสมัครขั้นต่ำ`, `โบนัสสูงสุดต่อครั้ง`, 'ข้อกำหนดของยอดหมุนเวียน']).toString().split(',')
export const VipDetailsInfor = [
    ['VIP 1', '8%', '500', '3,000', '10 ครั้ง', '8%', '500', '3,000', '15 ครั้ง', '12%', '500', '3,000', '12 ครั้ง', '12%', '500', '3,000', '12 ครั้ง'],
    ['VIP 2', '8%', '500', '3,000', '10 ครั้ง', '8%', '500', '3,000', '15 ครั้ง', '12%', '500', '3,000', '12 ครั้ง', '12%', '500', '3,000', '12 ครั้ง'],
    ['VIP 3', '8%', '500', '3,000', '10 ครั้ง', '8%', '500', '3,000', '15 ครั้ง', '12%', '500', '3,000', '12 ครั้ง', '12%', '500', '3,000', '12 ครั้ง'],
    ['VIP 4', '10%', '500', '3,000', '10 ครั้ง', '9%', '500', '3,000', '15 ครั้ง', '14%', '500', '3,000', '12 ครั้ง', '14%', '500', '3,000', '12 ครั้ง'],
    ['VIP 5', '10%', '500', '3,000', '10 ครั้ง', '9%', '500', '3,000', '15 ครั้ง', '14%', '500', '3,000', '12 ครั้ง', '14%', '500', '3,000', '12 ครั้ง'],
    ['VIP 6', '12%', '500', '3,000', '10 ครั้ง', '9%', '500', '3,000', '15 ครั้ง', '14%', '500', '3,000', '12 ครั้ง', '14%', '500', '3,000', '12 ครั้ง'],
    ['VIP 7', '12%', '500', '3,000', '10 ครั้ง', '10%', '500', '3,000', '15 ครั้ง', '16%', '500', '3,000', '12 ครั้ง', '16%', '500', '3,000', '12 ครั้ง'],
    ['VIP 8', '12%', '500', '3,000', '10 ครั้ง', '10%', '500', '3,000', '15 ครั้ง', '16%', '500', '3,000', '12 ครั้ง', '16%', '500', '3,000', '12 ครั้ง'],
    ['VIP 9', '13%', '500', '3,000', '10 ครั้ง', '12%', '500', '3,000', '15 ครั้ง', '18%', '500', '3,000', '12 ครั้ง', '18%', '500', '3,000', '12 ครั้ง'],
    ['VIP 10', '13%', '500', '3,000', '10 ครั้ง', '12%', '500', '3,000', '15 ครั้ง', '18%', '500', '3,000', '12 ครั้ง', '18%', '500', '3,000', '12 ครั้ง']
]
// export const VipDetailsTitleInfor1 = [`电竞/体育${'\n'}（每日）`, `真人${'\n'}（每周）`, `棋牌${'\n'}（每日）`, `电玩${'\n'}（每日）`]
// export const VipDetailsTitleInfor2 = Array.from({ length: VipDetailsTitleInfor1.length }, v => ['红利比例', `最低申请${'\n'}金额`, `单笔申请最${'\n'}高可得红利`, '流水要求']).toString().split(',')
// export const VipDetailsInfor = [
//     ['VIP 1', '8%', '100', '600', '10 ครั้ง', '8%', '1000', '1000', '15 ครั้ง', '12%', '100', '800', '12 ครั้ง', '12%', '100', '800', '12 ครั้ง'],
//     ['VIP 2', '8%', '100', '600', '10 ครั้ง', '8%', '1000', '1000', '15 ครั้ง', '12%', '100', '800', '12 ครั้ง', '12%', '100', '800', '12 ครั้ง'],
//     ['VIP 3', '8%', '100', '600', '10 ครั้ง', '8%', '1000', '1000', '15 ครั้ง', '12%', '100', '800', '12 ครั้ง', '12%', '100', '800', '12 ครั้ง'],
//     ['VIP 4', '10%', '100', '600', '10 ครั้ง', '9%', '1000', '1000', '15 ครั้ง', '14%', '100', '800', '12 ครั้ง', '14%', '100', '800', '12 ครั้ง'],
//     ['VIP 5', '10%', '100', '600', '10 ครั้ง', '9%', '1000', '1000', '15 ครั้ง', '14%', '100', '800', '12 ครั้ง', '14%', '100', '800', '12 ครั้ง'],
//     ['VIP 6', '10%', '100', '600', '10 ครั้ง', '9%', '1000', '1000', '15 ครั้ง', '14%', '100', '800', '12 ครั้ง', '14%', '100', '800', '12 ครั้ง'],
//     ['VIP 7', '12%', '100', '600', '10 ครั้ง', '10%', '1000', '1000', '15 ครั้ง', '16%', '100', '800', '12 ครั้ง', '16%', '100', '800', '12 ครั้ง'],
//     ['VIP 8', '12%', '100', '600', '10 ครั้ง', '10%', '1000', '1000', '15 ครั้ง', '16%', '100', '800', '12 ครั้ง', '16%', '100', '800', '12 ครั้ง'],
//     ['VIP 9', '13%', '100', '600', '10 ครั้ง', '12%', '1000', '1000', '15 ครั้ง', '18%', '100', '800', '12 ครั้ง', '18%', '100', '800', '12 ครั้ง'],
//     ['VIP 10', '13%', '100', '600', '10 ครั้ง', '12%', '1000', '1000', '15 ครั้ง', '18%', '100', '800', '12 ครั้ง', '18%', '100', '800', '12 ครั้ง']
// ]
export const VipDetailsInforLogout = [
   // [`VIP${'\n'}等级`, ...VipDetailsTitleInfor1],
    [`ระดับ VIP`, ...VipDetailsTitleInfor1],
  
]

export const VipDetailsInforLogout2 = [
    // [`VIP${'\n'}等级`, ...VipDetailsTitleInfor1],
    
     ['โบนัสเงินเพิ่ม', '8%', '8%', '12%', '12%'],
     ['ฝากขั้นต่ำ', '500', '500', '500', '500'],
     ['เงินคืนสูงสุด', '3,000', '3,000', '3,000', '3,000'],
     ['ยอดหมุนเวียน', '10 เท่า', '15 เท่า', '12 เท่า', '12 เท่า'],
 ]

 export const VipDetailsInforLogout3 = [
    // [`VIP${'\n'}等级`, ...VipDetailsTitleInfor1],
     
     ['VIP 2'],
     ['โบนัสเงินเพิ่ม', '8%', '8%', '12%', '12%'],
     ['ฝากขั้นต่ำ', '500', '500', '500', '500'],
     ['เงินคืนสูงสุด', '3,000', '3,000', '3,000', '3,000'],
     ['ยอดหมุนเวียน', '10 เท่า', '15 เท่า', '12 เท่า', '12 เท่า'],
     ['VIP 3'],
     ['โบนัสเงินเพิ่ม', '8%', '8%', '12%', '12%'],
     ['ฝากขั้นต่ำ', '500', '500', '500', '500'],
     ['เงินคืนสูงสุด', '3,000', '3,000', '3,000', '3,000'],
     ['ยอดหมุนเวียน', '10 เท่า', '15 เท่า', '12 เท่า', '12 เท่า'],
     ['VIP 4'],
     ['โบนัสเงินเพิ่ม', '10%', '9%', '14%', '14%'],
     ['ฝากขั้นต่ำ', '500', '500', '500', '500'],
     ['เงินคืนสูงสุด', '3,000', '3,000', '3,000', '3,000'],
     ['ยอดหมุนเวียน', '10 เท่า', '15 เท่า', '12 เท่า', '12 เท่า'],
     ['VIP 5'],
     ['โบนัสเงินเพิ่ม', '10%', '9%', '14%', '14%'],
     ['ฝากขั้นต่ำ', '500', '500', '500', '500'],
     ['เงินคืนสูงสุด', '3,000', '3,000', '3,000', '3,000'],
     ['ยอดหมุนเวียน', '10 เท่า', '15 เท่า', '12 เท่า', '12 เท่า'],
     ['VIP 6'],
     ['โบนัสเงินเพิ่ม', '12%', '9%', '14%', '14%'],
     ['ฝากขั้นต่ำ', '500', '500', '500', '500'],
     ['เงินคืนสูงสุด', '3,000', '3,000', '3,000', '3,000'],
     ['ยอดหมุนเวียน', '10 เท่า', '15 เท่า', '12 เท่า', '12 เท่า'],
     ['VIP 7'],
     ['โบนัสเงินเพิ่ม', '12%', '10%', '16%', '16%'],
     ['ฝากขั้นต่ำ', '500', '500', '500', '500'],
     ['เงินคืนสูงสุด', '3,000', '3,000', '3,000', '3,000'],
     ['ยอดหมุนเวียน', '10 เท่า', '15 เท่า', '12 เท่า', '12 เท่า'],
     ['VIP 8'],
     ['โบนัสเงินเพิ่ม', '12%', '10%', '16%', '16%'],
     ['ฝากขั้นต่ำ', '500', '500', '500', '500'],
     ['เงินคืนสูงสุด', '3,000', '3,000', '3,000', '3,000'],
     ['ยอดหมุนเวียน', '10 เท่า', '15 เท่า', '12 เท่า', '12 เท่า'],
     ['VIP 9'],
     ['โบนัสเงินเพิ่ม', '13%', '12%', '18%', '18%'],
     ['ฝากขั้นต่ำ', '500', '500', '500', '500'],
     ['เงินคืนสูงสุด', '3,000', '3,000', '3,000', '3,000'],
     ['ยอดหมุนเวียน', '10 เท่า', '15 เท่า', '12 เท่า', '12 เท่า'],
     ['VIP 10'],
     ['โบนัสเงินเพิ่ม', '13%', '12%', '18%', '18%'],
     ['ฝากขั้นต่ำ', '500', '500', '500', '500'],
     ['เงินคืนสูงสุด', '3,000', '3,000', '3,000', '3,000'],
     ['ยอดหมุนเวียน', '10 เท่า', '15 เท่า', '12 เท่า', '12 เท่า'],
 ]
export const VipDetailsTextInfor = [
    'แนะนำ: เมื่อเดิมพัน โบนัสเท่านั้นที่จะถูกล็อคไว้ เงินต้นที่เดิมพันจะไม่มีผลต่อการถอนเงิน',
    //'注：在进行有效投注时，彩金为锁定状态，仅本金可 进行投注，且不会影响提款。',
    'การคำนวณยอดหมุนเวียน: (เงินต้น 100 บาท + โบนัส 10 บาท) * 10 = 1,100',
    //'流水计算:（100 บาท本金 + 10 บาท红利）*10 = 1,100。',
    'ข้อควรระวัง',
    //'注意事项',
    '1. คุณต้องทำยอดหมุนเวียนให้ครบภายใน 15 วันหลังจากการสมัคร',
    '2. เกม “Niu Niu” ที่ คาสิโน AG จะไม่นำมานับเป็นยอดหมุนเวียน',
    '3. เกม "Dancing Dragon" "Bikini Party" "Gem Reel" และ P2P "บาคาร่า" and "Hundred Dragon Tiger" ของเกมสล็อต MGS จะไม่นำมานับเป็นยอดหมุนเวียน',
    '4.ในเกมการเดิมพันกีฬา และ อีสปอร์ต การเดิมพันแพ้ชนะเท่านั้นจะนับยอดหมุนเวียน หากผลการเดิมพัน เสมอ ยกเลิก หรือการเดิมพัน 2 ฝั่ง ที่อัตราต่อรอง DEC น้อยกว่า 1.7, HK  น้อยกว่า 0.7 , MY  น้อยกว่า 0.7, INDO น้อยกว่าหรือเท่ากับ -1.43 และ US น้อยกว่าหรือเท่ากับ -143 จะไม่นับเป็นยอดหมุนเวียน',
    '5.ในการเดิมพันกีฬา สำหรับชนะครึ่ง แพ้ครั้ง จะนับเพียงครึ่งเดียวของจำนวนเดิมพันเท่านั้น และข้อกำหนดนี้เป็นไปตามข้อกำหนดพื้นฐานสำหรับการแข่งขัน'
    //'1. 申请后需要在 15 天内完成流水要求。',
    // '2. AG真人娱乐的“牛牛”游戏不计算为有效流水。',
    // '3. MGS电玩的《舞龙》游戏，《比基尼派对》游戏，《宝石转轴》游戏，棋牌的《百家乐》游戏和《百人龙虎》游戏不计算为有效流水。',
    // '4. 在体育博彩与电子竞技游戏中仅对产生输赢结果的投注额进行计算，任何和局、取消的赛事、赔率低于欧洲盘1.70，香港盘0.70，马来盘0.70，印尼盘-1.43的投注将不计算在有效投注内。',
    // '5. 在体育博彩中赢半/输半的注单，只计算投注金额的一半流水。此活动必须遵守竞博标准条款。'
]
export const VipOverviewDetails = [
    {
        img: VipIconImg,
        title:'VIP ระดับ 10',
        text:'จะอัปเกรดเมื่อได้รับเงินฝากและการโอนเงิน'
        //title: '10级VIP',
       // text: '存款和流水符合即可晋级'
    },
    {
        img: require('./../../../images/user/vip/vipOverviewDetails1.png'),
        title:'ข้อดีของการเป็น VIP ',
        text:'อัปเกรดโบนัส, โบนัสเดิม, โบนัสเติมเงินสุดพิเศษ'
        // title: '竞博VIP优势',
        // text: '升级礼金，保级礼金，专属再存'
    },
    {
        img: require('./../../../images/user/vip/vipOverviewDetails2.png'),
        title:'การเลื่อนระดับรายวัน',
        text:'ฝากเงินและทำยอดหมุนเวียนเพื่อเลื่อนระดับรายวัน'
        // title: '每日晋级',
        // text: '只需完成晋级存款金额与流水即可每日晋级'
    }
]
export const VipOverviewSteps = [
    {
        img: require('./../../../images/user/vip/vipOverviewSteps0.png'),
        text: 'ฝากเงิน'
    },
    {
        img: require('./../../../images/user/vip/vipOverviewSteps1.png'),
        text:'เล่น'
        // text: '游戏'
    },
    {
        img: require('./../../../images/user/vip/vipOverviewSteps3.png'),
        text: 'เลื่อนระดับ'//'升级'
    },
    {
        img: require('./../../../images/user/vip/vipOverviewSteps4.png'),
        text: 'รับ'//'领奖'
    },
]
// export const VipOverviewSteps = [
//     {
//         img: require('./../../../images/user/vip/vipOverviewSteps0.png'),
//         text: '存款'
//     },
//     {
//         img: require('./../../../images/user/vip/vipOverviewSteps1.png'),
//         text: '游戏'
//     },
//     {
//         img: require('./../../../images/user/vip/vipOverviewSteps3.png'),
//         text: '升级'
//     },
//     {
//         img: require('./../../../images/user/vip/vipOverviewSteps4.png'),
//         text: '领奖'
//     },
// ]

export const VipMainData = [
    {
        title: 'ภาพรวมของ VIP', //'VIP总览',
        text: 'การเข้าร่วม',  //'如何参与',
        router: 'VipOverview',
        img: require('./../../../images/user/vip/vipMainImg1.png')
    },
    {
        title: 'ศูนย์ VIP',//'VIP中心',
        text: 'ตรวจสอบสถานะ',//'查看进度',
        router: 'Vip',
        img: require('./../../../images/user/vip/vipMainImg2.png')
    }
]

const styles = StyleSheet.create({
    vipText11: {
        color: '#ccc',
        lineHeight: 22,
        marginBottom: 4,
        fontSize:12
    },
    vipText22: {
        color: '#ccc',
        lineHeight: 22,
        marginBottom: 4,

    },
    vipTextBOx22: {
        position: 'absolute',
        left: 0
    },
    vipTextBOx11: {
        paddingLeft: 18
    },
    vipText222: {
        color: '#fff',
        lineHeight: 18
    },
    vipText111: {
        color: '#fff', 
        lineHeight: 18, 
    }
})

export const VipRules = [
    <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}>1. </Text></View><Text style={styles.vipText11}>สมาชิกที่มียอดเงินฝากและยอดหมุนเวียนสะสมภายใน 30 วัน ตรงตามข้อกำหนดของระดับ VIP สามารถเลื่อนระดับเป็นระดับ VIP ก่อนเวลา 08:00 น.(GMT+8) ของวันถัดไป</Text></View>,
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText22}></Text>
        </View>
        </View>,
        //<Text style={styles.vipText11}>（例子：今天3月14日，系统将计算29天前至今【2月13日至3月14日】的累积存款以及累积流水。）</Text></View>,
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText22}>2. </Text>
        </View>
        <Text style={styles.vipText11}>
        ลำดับถัดไป：ระดับของ VIP หากเป็นไปตามข้อกำหนด สามารถเลื่อนระดับได้ในทุกวัน แต่ VIP ไม่สามารถเลื่อนเกินระดับที่กำหนดได้ ข้อแนะนำ: ระบบจะทำการคำนวณและเลื่อนระดับ VIP ตามลำดับปัจจุบัน แต่หากคุณสามารถทำเข้าข้อกำหนดได้ล่วงหน้า ดังนั้นวันต่อไปจะสามารถเลื่อนระดับเป็น VIP ระดับถัดไป และยังคงต้องรักษาระดับตามข้อกำหนดในการอยู่ในระดับ VIP นั้นๆ (ตัวอย่าง สมาชิกใหม่ ก สมัครมาวันที่ 2 พย. และฝาก 5,000 บาท และทำยอดหมุนเวียนได้ 30,000 บาท สมาชิกใหม่ ก จะสามารถได้ VIP ระดับที่ 3 ตามข้อกำหนด ดังนั้นระบบจะทำการเลื่อนระดับเป็นแค่ VIP 1 เท่านั้น เพราะระบบสามารถเลื่อนระดับได้ทีละ 1 ระดับ โดยต้องเริ่มจาก ระดับที่ VIP 1 ไม่สามารถเลื่อนไปที่ VIP 3 ได้เลย)
            </Text>
        </View>,
 
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}><Text style={styles.vipText22}>3. </Text>
        </View>
        <Text style={styles.vipText11}>การรักษาระดับ：หลังจากที่ได้ระดับ VIP แล้ว สมาชิกจำเป็นต้องฝากเงินและทำยอดหมุนเวียนให้ตรงตามเงื่อนไข ภายใน 30 วัน แต่หากโปรโมชั่นจบลงในช่วงระหว่างนี้ จะมีการคิดยอดคำนวณใหม่ตามระดับปัจจุบัน (ตัวอย่าง: สมาชิก ก รักษาระดับ VIP 3 จากวันที่ 2 พย. จนระยะเวลาถึงวันที่ 29 พย. จะถูกเลื่อนเป็น VIP ระดับ 4 ได้ ซึ่งในระหว่างนี้ สมาชิกจะได้รับ [รางวัลเลื่อนระดับ] ทั้งนี้สมาชิกจำเป็นต้องทำยอดรักษาระดับภายใน 30 วันจากวันที่ได้เลื่อน ดังนั้นสมาชิกจะสามารถเลื่อนเป็นระดับ 4 ได้)</Text>
        </View>,
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText22}></Text>
            </View> 
            </View>,
    
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText22}>4. </Text>
            </View>
            <Text style={styles.vipText11}>เหตุผลของการลดระดับ：หากสมาชิกไม่สามารถทำตามข้อกำหนดเงื่อนไขในการรักษาระดับได้ภายใน 30 วัน สมาชิกจะถูกลดระดับลง และ ได้รับโบนัสฝากเงินอีกครั้งและสิทธิประโยชน์อื่นๆจากระดับนั้นๆ ตามข้อกำหนด</Text>
            </View>,
    
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText22}>5. </Text>
            </View>
            <Text style={styles.vipText11}>อัพเกรดโบนัส：หลังจากสมาชิกถึงระดับ VIP แล้ว ระบบจะอัพเดตโปรโมชั่นอัตโนมัติก่อน 21:00 น. ตามเวลาประเทศไทย ในระยะเวลาโปรโมชั่น สมาชิกแต่ละคนจะได้รับรางวัลเลื่อนระดับสำหรับระดับ VIP ครั้งเดียว (โบนัสเลื่อนระดับต้องทำยอดหมุนเวียน 1 เท่าจึงสามารถถอนได้) สำหรับรางวัล VIP8 VIP9 VIP10 ต้องติดต่อที่แผนก VIP หลังจากการสมัครและจึงได้รับโบนัส</Text></View>,
    
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText22}>6. </Text>
            </View
            ><Text style={styles.vipText11}>รักษาระดับโบนัส：หากสมาชิกคุณสมบัติตรงตามข้อกำหนดของยอดฝากและทำหมุนเวียนภายใน 30 วัน ระบบจะเครดิตรางวัลสำหรับ VIP ในแต่ละระดับก่อน 21:00 น. ของวันถัดไป หลังจาก30วัน หากสมาชิกได้รับการเลื่อนขั้นอีกครั้งภายใน 30 วันเขาจะได้รับเพียง โบนัสตามโปรโมชั่นเท่านั้นไม่ใช่โบนัสจากการเลื่อนระดับ (โบนัสเลื่อนระดับต้องทำยอดหมุนเวียน 1 เท่าจึงสามารถถอนได้) สำหรับรางวัล VIP8 VIP9 VIP10 ต้องติดต่อที่แผนก VIP หลังจากการสมัครและจึงได้รับโบนัส</Text></View>,
    
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText22}>7. </Text>
            </View>
            <Text style={styles.vipText11}>โบนัสฝากอีกครั้ง：หลักจากได้ระดับ VIP นั้นๆแล้ว สมาชิกสามารถสมัครโบนัสฝากเงินเองได้ตามโปรโมชั่น การเลื่อนหรือลดระดับจะไม่เกี่ยวข้องกับโบนัสฝากเงินที่เคยได้สมัครมาแล้ว แนะนำ: VIP8 VIP9 และ VIP10 จะไม่ได้รับการเลื่อนระดับอัตโนมัติ ทางฝ่าย VIP จะเป็นฝ่ายตรวจสอบในแต่ละเดือน หากคุณสามารถผ่านข้อกำหนดใดๆ ทางฝ่าย VIP จะติดต่อสมาชิกเพื่อเลื่อนระดับไปในแต่ระดับ ไล่ตั้งแต่ VIP8 VIP9 และ VIP10</Text></View>,
    <View style={styles.vipTextBOx11}><
        View style={styles.vipTextBOx22}>
        <Text style={styles.vipText22}></Text></View>
        </View>,
    
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText22}>8. </Text></View>
            <Text style={styles.vipText11}>หากสมาชิกทำยอดฝากและยอดหมุนเวียนภายใน 30 วัน แถบเลื่อนระดับจะแสดงถึงยอดอีกเท่าไหร่ที่จะเลื่อนไปยังระดับถัดไป [VIP 4]</Text></View>,
    
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText22}>9. </Text></View>
            <Text style={styles.vipText11}>JBO ขอสงวนสิทธิ์ในการแก้ไขและเปลี่ยนแปลงเงื่อนไขของระบบ VIP โดยไม่ต้องแจ้งให้ทราบล่วงหน้า</Text></View>,
    
 
]


// export const VipRules = [
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}>1. </Text></View><Text style={styles.vipText11}>晋升标准：会员的30天累计存款以及30天累计流水达到相应级别的要求，即可在次日08:00前晋升相应的VIP等级。</Text></View>,
//     <View style={styles.vipTextBOx11}>
//         <View style={styles.vipTextBOx22}>
//             <Text style={styles.vipText22}></Text>
//         </View>
//         <Text style={styles.vipText11}>（例子：今天3月14日，系统将计算29天前至今【2月13日至3月14日】的累积存款以及累积流水。）</Text></View>,
//     <View style={styles.vipTextBOx11}>
//         <View style={styles.vipTextBOx22}>
//             <Text style={styles.vipText22}>2. </Text>
//         </View>
//         <Text style={styles.vipText11}>晋升顺序：VIP等级达到相应的要求即可每天晋升一级，但VIP等级不可越级晋升。</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}></Text></View><Text style={styles.vipText11}>注：系统将会根据当前的VIP等级计算和升级，若您提前完成条件次日会自动升级。保持等级将需要完成指定的等级要求。</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}></Text></View><Text style={styles.vipText11}>例子：新注册会员A（11月2日），存款了1000บาท并完成流水6000บาท。他已经达到了VIP 3的条件，但是系统将会每日升一级（从VIP 1开始）而不会越级晋升VIP 3。）</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}>3. </Text></View><Text style={styles.vipText11}>保级要求：会员在达到某VIP等级后，需要在30天内达到保级存款和流水要求。如果在此期间完成晋升，保级流水的要求将重新按照当前等级计算。</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}></Text></View><Text style={styles.vipText11}>（例子：会员A从11月2日保持VIP 3，但是在保级的第29天，他荣升VIP 4。此时会员将会获得【升级礼金】，他需要从新开始完成30天的保级条件才可以获得VIP 4保级礼金。)</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}>4. </Text></View><Text style={styles.vipText11}>降级标准：如果会员在30天内没有完成相应的保级流水要求，系统会降级一个等级，相应的再存红利及其他的优惠也会随之调整至降级后的等级。</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}>5. </Text></View><Text style={styles.vipText11}>升级礼金：升级礼金在会员达到该VIP等级后，系统将会在晋升当天的20:00前自动派发，每个VIP等级的升级礼金每位会员仅能获得1次。（升级礼金1ครั้ง流水即可提款。）</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}>6. </Text></View><Text style={styles.vipText11}>保级礼金：会员在30天内达到保级存款和流水要求，系统将会在完整30天后的次日20:00前自动派发相应的VIP等级保级礼金。如果他在30天内晋升，他只会得到升级 礼金，并不会得到之前级别的保级礼金。（保级礼金1ครั้ง流水即可提款。）</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}>7. </Text></View><Text style={styles.vipText11}>再存红利：会员在达到某VIP等级后，将会依据相应级别的再存红利自助申请。升级或降级不会影响他之前所申请的再存红利。</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}></Text></View><Text style={styles.vipText11}>注：VIP 8, VIP 9 和 VIP 10 的等级是不会自动晋升。VIP专员将会在每个月底进行一次审核。如果会员成功通过审核，VIP专员将会联系会员，之后再将会员晋升到相应的VIP 8，VIP 9，VIP 10的等级。</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}>8. </Text></View><Text style={styles.vipText11}>返水比例: 返水彩金将在结算次日 13:00 前派发。返水彩金将根据次日会员的VIP等级进行计算。</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}>9. </Text></View><Text style={styles.vipText11}>当竞博VIP开始，所有会员会从普通会员级别开始。新注册会员也是从普通会员级别开始。</Text></View>,
//     <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText22}>10. </Text></View><Text style={styles.vipText11}>如果会员在VIP 3，30天达累计存款金额和30天累计流水是显示升级VIP 4的要求和会员的进度，30天达保级有效存款及流水是显示保级VIP 3的要求和会员的进度。</Text></View>,
//     <View style={styles.vipTextBOx11}>
//         <View style={styles.vipTextBOx22}>
//             <Text style={styles.vipText22}>11. </Text>
//         </View>
//         <Text style={styles.vipText11}>竞博保留对活动的修改，停止及最终解释权。</Text></View>
// ]

export const VipRankInforData = [
    {
        upgradeGift: 'ไม่มี',
        relegationGifts: 'ไม่มี',
        cumulativeDeposit: '100',  // 30天累计存款
        cumulativeEffectiveFlow: '600', // 30天累计有效流水
        reachedWithinDeposit: '100', // 30天内达到存款
        reachedWithinEffectiveWaterFlow: '600' // 30天内达到有效流水
    },
    {
        upgradeGift: '8 บาท',
        relegationGifts: 'ไม่มี',
        cumulativeDeposit: '500',
        cumulativeEffectiveFlow: '3,000',
        reachedWithinDeposit: '500',
        reachedWithinEffectiveWaterFlow: '3,000'
    },
    {
        upgradeGift: '18 บาท',
        relegationGifts: '8 บาท',
        cumulativeDeposit: '1,000',
        cumulativeEffectiveFlow: '6,000',
        reachedWithinDeposit: '1,000',
        reachedWithinEffectiveWaterFlow: '6,000'
    },
    {
        upgradeGift: '28 บาท',
        relegationGifts: '18 บาท',
        cumulativeDeposit: '2,500',
        cumulativeEffectiveFlow: '15,000',
        reachedWithinDeposit: '2,500',
        reachedWithinEffectiveWaterFlow: '15,000'
    },
    {
        upgradeGift: '58 บาท',
        relegationGifts: '28 บาท',
        cumulativeDeposit: '5,000',
        cumulativeEffectiveFlow: '30,000',
        reachedWithinDeposit: '5,000',
        reachedWithinEffectiveWaterFlow: '30,000'
    },
    {
        upgradeGift: '88 บาท',
        relegationGifts: '58 บาท',
        cumulativeDeposit: '15,000',
        cumulativeEffectiveFlow: '90,000',
        reachedWithinDeposit: '15,000',
        reachedWithinEffectiveWaterFlow: '90,000'
    },
    {
        upgradeGift: '188 บาท',
        relegationGifts: '88 บาท',
        cumulativeDeposit: '50,000',
        cumulativeEffectiveFlow: '300,000',
        reachedWithinDeposit: '50,000',
        reachedWithinEffectiveWaterFlow: '300,000'
    },
    {
        upgradeGift: '388 บาท',
        relegationGifts: '188 บาท',
        cumulativeDeposit: '200,000',
        cumulativeEffectiveFlow: '1,200,000',
        reachedWithinDeposit: '150,000',
        reachedWithinEffectiveWaterFlow: '900,000'
    },
    {
        upgradeGift: '888 บาท',
        relegationGifts: '388 บาท',
        cumulativeDeposit: '500,000',
        cumulativeEffectiveFlow: '3,000,000',
        reachedWithinDeposit: '500,000',
        reachedWithinEffectiveWaterFlow: '3,000,000'
    },
    {
        upgradeGift: '1888 บาท',
        relegationGifts: '888 บาท',
        cumulativeDeposit: '1,000,000',
        cumulativeEffectiveFlow: '6,000,000',
        reachedWithinDeposit: '1,000,000',
        reachedWithinEffectiveWaterFlow: '6,000,000'
    },
]

export const PromotionVipDetailsTables = [
    [`สมาชิก ระบบปกติ`, '0', '0', 'ไม่มี', '0', '0', 'ไม่มี'],
    ['VIP 1', '1,000', '6,000', 'ไม่มี', '1,000', '6,000', 'ไม่มี'],
    ['VIP 2', '5,000', '30,000', '100', '5,000', '30,000', 'ไม่มี'],
    ['VIP 3', '10,000', '60,000', '200', '10,000', '60,000', '50'],
    ['VIP 4', '25,500', '150,000', '300', '25,000', '150,000', '100'],
    ['VIP 5', '50,000', '300,000', '500', '50,000', '300,000', '150'],
    ['VIP 6', '100,000', '600,000', '600', '100,000', '600,000', '200'],
    ['VIP 7', '250,000', '1,500,000', '700', '250,000', '1,500,000', '250'],
    ['VIP 8', '500,000', '3,000,000', '900', '500,000', '3,000,000', '450'],
    ['VIP 9', '1,000,000', '6,000,000', '1,700', '1,000,000', '6,000,000', '700'],
    ['VIP 10', '3,000,000', '18,000,000', '5,600', '3,000,000', '18,000,000', '2,500'],
]

export const PromotionVipDetailsRules = [
    '1. สมาชิกที่มียอดเงินฝากและยอดหมุนเวียนสะสมภายใน 30 วัน ตรงตามข้อกำหนดของระดับ VIP สามารถเลื่อนระดับเป็นระดับ VIP ก่อนเวลา 08:00 น.(GMT+8) ของวันถัดไป',
    '2. ระดับของ VIP หากเป็นไปตามข้อกำหนด สามารถเลื่อนระดับได้ในทุกวัน แต่ VIP ไม่สามารถเลื่อนเกินระดับที่กำหนดได้',
    '（例如：会员A刚注册在11月2日，他当天存款1000บาท并达到有效流水6000。11月3日他将会晋升一级到VIP 1，如果这天他没有任何存款和没有任何流水，按照30天累计 存款1000บาท和30天累计有效流水6000บาท，11月4日他会再晋升一级到VIP 2，11月5日他会再次升级到VIP 3。）',
    '3. 保级要求：会员在达到某VIP等级后，需要在30天内达到保级存款和有效流水要求。如果在此期间完成晋升，保级有效流水的要求将重新按照当前等级计算。',
    '4. 降级标准：如果会员在30天内没有完成相应的保级有效流水要求，系统会降级一个等级，相应的再存红利及其他的优惠也会随之调整至降级后的等级。',
    '5. 升级礼金：升级礼金在会员达到该VIP等级后，系统将会在晋升当天的20:00前自动派发，每个VIP等级的升级礼金每位会员仅能获得1次。 （升级礼金1ครั้ง流水即可提款。）',
    '6. 保级礼金：会员在30天内达到保级存款和有效流水要求，系统将会在完整30天后的次日20:00前自动派发相应的VIP等级保级礼金。如果他在30天内晋升，他只会得到 升级礼金，并不会得到之前级别的保级礼金。（保级礼金1ครั้ง流水即可提款。）',
    '7. 再存红利：会员在达到某VIP等级后，将会依据相应级别的再存红利自助申请。 注：VIP 8, VIP 9 和 VIP 10 的等级是不会自动晋升。VIP专员将会在每个月底进行一次审核。如果会员成功通过审核，VIP专员将会联系会员，之后再将会员晋升到相应的VIP 8，VIP 9，VIP 10的等级。',
    '8. 竞博保留对活动的修改，停止及最终解释权。',
]

// export const PromotionVipDetailsRules = [
//     '1. 晋升标准：会员的30天累计存款以及30天累计投注额达到相应级别的要求，即可在次日20:00前普级相应的VIP等级。',
//     '2. 晋升顺序：VIP等级达到相应的要求即可每天晋升一级，但VIP等级不可越级晋升。',
//     '（例如：会员A刚注册在11月2日，他当天存款1000บาท并达到有效流水6000。11月3日他将会晋升一级到VIP 1，如果这天他没有任何存款和没有任何流水，按照30天累计 存款1000บาท和30天累计有效流水6000บาท，11月4日他会再晋升一级到VIP 2，11月5日他会再次升级到VIP 3。）',
//     '3. 保级要求：会员在达到某VIP等级后，需要在30天内达到保级存款和有效流水要求。如果在此期间完成晋升，保级有效流水的要求将重新按照当前等级计算。',
//     '4. 降级标准：如果会员在30天内没有完成相应的保级有效流水要求，系统会降级一个等级，相应的再存红利及其他的优惠也会随之调整至降级后的等级。',
//     '5. 升级礼金：升级礼金在会员达到该VIP等级后，系统将会在晋升当天的20:00前自动派发，每个VIP等级的升级礼金每位会员仅能获得1次。 （升级礼金1ครั้ง流水即可提款。）',
//     '6. 保级礼金：会员在30天内达到保级存款和有效流水要求，系统将会在完整30天后的次日20:00前自动派发相应的VIP等级保级礼金。如果他在30天内晋升，他只会得到 升级礼金，并不会得到之前级别的保级礼金。（保级礼金1ครั้ง流水即可提款。）',
//     '7. 再存红利：会员在达到某VIP等级后，将会依据相应级别的再存红利自助申请。 注：VIP 8, VIP 9 和 VIP 10 的等级是不会自动晋升。VIP专员将会在每个月底进行一次审核。如果会员成功通过审核，VIP专员将会联系会员，之后再将会员晋升到相应的VIP 8，VIP 9，VIP 10的等级。',
//     '8. 竞博保留对活动的修改，停止及最终解释权。',
// ]


export const VipDetailQuestion = [
    {
        title: 'จะเลื่อนเป็น VIP ของ JBO ได้อย่างไร?',
        text: 'หากคุณมีจำนวนเงินฝากและยอดหมุนเวียน ตามข้อกำหนดภายใน 30 วันคุณสามารถเลื่อนระดับเป็น VIP ได้',
        img: require('./../../../images/user/vip/vipDetail1.png')
    },
    {
        title: 'VIP มีกี่ระดับที่ JBO?',
        text: 'VIP มีทั้งหมด 10 ระดับ',
        img: require('./../../../images/user/vip/vipDetail2.png')
    },
    {
        title: 'หากฉันได้รับการเลื่อนระดับเป็น VIP จะรักษาระดับ VIP ได้อย่างไร?',
        text: 'คุณจำเป็นต้องมีจำนวนเงินฝากและยอดหมุนเวียน ตามข้อกำหนดภายใน 30 วัน เพื่อรักษาระดับการเป็น VIP ได้',
        img: require('./../../../images/user/vip/vipDetail3.png')
    },
    {
        title: 'สิทธิประโยชน์ในการเลื่อนระดับเป็น VIP?',
        text: 'ระดับ VIP แต่ละระดับจะมีส่วนลด และ ยอดโบนัสฝากเงินแตกต่างและในขณะเดียวกันจะมีสิทธิพิเศษและรางวัลพิเศษอื่นๆ ที่จะแจ้งให้ทราบสำหรับ VIP',
        img: require('./../../../images/user/vip/vipDetail4.png')
    },
    // {
    //     title: '如何晋升成为竞博VIP?',
    //     text: '在30天内达到相应的有效存款金额以及流水要求，即可晋升为竞博VIP',
    //     img: require('./../../../images/user/vip/vipDetail1.png')
    // },
    // {
    //     title: '竞博VIP一共有几个等级？',
    //     text: '竞博VIP一共有10个等级。',
    //     img: require('./../../../images/user/vip/vipDetail2.png')
    // },
    // {
    //     title: '若晋升为竞博VIP,如何保持VIP的等级？',
    //     text: '您只需30天内达到当下的VIP保级有效存款金额以及流水额要求, 即可维持您当下的VIP等级。',
    //     img: require('./../../../images/user/vip/vipDetail3.png')
    // },
    // {
    //     title: '晋升成为竞博VIP的好处？',
    //     text: '不同的VIP 等级享有不同的优惠，再存红利及返还彩金，同时还会不定时推出VIP优惠活动以及额外奖励。',
    //     img: require('./../../../images/user/vip/vipDetail4.png')
    // },
]

export const PromotionVipDetailsRulesVip = [

    {
        title: 'เกณฑ์ระดับถัดไป',
        textWrap: [
            'สมาชิกที่มียอดเงินฝากและยอดหมุนเวียนสะสมภายใน 30 วัน ตรงตามข้อกำหนดของระดับ VIP สามารถเลื่อนระดับเป็นระดับ VIP ก่อนเวลา 08:00 น.(GMT+8) ของวันถัดไป' 
        ]
    },
    {
        title: 'ลำดับถัดไป',
        textWrap: [
            'ระดับของ VIP หากเป็นไปตามข้อกำหนด สามารถเลื่อระดับ ได้ในทุกวัน แต่ VIP ไม่สามารถเลื่อนเกินระดับที่กำหนดได้' 
        ]
    },
    {
        title: 'การรักษาระดับ',
        textWrap: [
             'ข้อแนะนำ: ระบบจะทำการคำนวณและเลื่อนระดับ VIP ตามลำดับปัจจุบัน แต่หากคุณสามารถทำเข้าข้อกำหนดได้ล่วงหน้า ดังนั้นวันต่อไปจะสามารถเลื่อนระดับเป็น VIP ระดับถัดไป และยังคงต้องรักษาระดับตามข้อกำหนด ในการอยู่ในระดับ VIP นั้นๆ (ตัวอย่าง สมาชิกใหม่ ก สมัครมาวันที่ 2 พย. และฝาก 5,000 บาท และทำยอดหมุนเวียนได้ 30,000 บาท สมาชิกใหม่ ก จะสามารถได้ VIP ระดับที่ 3 ตามข้อกำหนด ดังนั้นระบบจะทำการเลื่อนระดับ เป็นแค่ VIP 1 เท่านั้น เพราะระบบสามารถเลื่อนระดับได้ทีละ 1 ระดับ โดยต้องเริ่มจาก ระดับที่ VIP 1 ไม่สามารถเลื่อนไปที่ VIP 3 ได้เลย)'
        ]
    },
    {
        title: 'เหตุผลของการลดระดับ',
        textWrap: [
            'หากสมาชิกไม่สามารถทำตามข้อกำหนดเงื่อนไขในการรักษาระดับได้ภายใน 30 วัน สมาชิกจะถูกลดระดับลง และ ได้รับโบนัสฝากเงินอีกครั้งและสิทธิประโยชน์อื่นๆ จากระดับนั้นๆ ตามข้อกำหนด'
        ]
    },
    {
        title: 'อัพเกรดโบนัส',
        textWrap: [
            'หลังจากสมาชิกถึงระดับ VIP แล้ว ระบบจะอัพเดตโปรโมชั่นอัตโนมัติก่อน 21:00 น. ตามเวลาประเทศไทย ในระยะเวลาโปรโมชั่น สมาชิกแต่ละคนจะได้รับรางวัลเลื่อนระดับสำหรับระดับ VIP ครั้งเดียว (โบนัสเลื่อนระดับต้องทำยอดหมุนเวียน 1 เท่า จึงสามารถถอนได้) สำหรับรางวัล VIP8 VIP9 VIP10 ต้องติดต่อที่แผนก VIP หลังจากการสมัครและจึงได้รับโบนัส'
        ]
    },
    {
        title: 'รักษาระดับโบนัส',
        textWrap: [
            'หากสมาชิกคุณสมบัติตรงตามข้อกำหนดของยอดฝากและทำหมุนเวียนภายใน 30 วัน ระบบจะเครดิตรางวัลสำหรับ VIP ในแต่ละระดับก่อน 21:00 น. ของวันถัดไป หลังจาก30วัน หากสมาชิกได้รับการเลื่อนขั้นอีกครั้งภายใน 30 วันเขาจะได้รับเพียง โบนัสตามโปรโมชั่นเท่านั้นไม่ใช่โบนัสจากการเลื่อนระดับ (โบนัสเลื่อนระดับต้องทำยอดหมุนเวียน 1 เท่าจึงสามารถถอนได้) สำหรับรางวัล VIP8 VIP9 VIP10 ต้องติดต่อที่แผนก VIP หลังจากการสมัครและจึงได้รับโบนัส'
        ]
    },
    {
        title: 'โบนัสเติมเงิน',
        textWrap: [
            'หลักจากได้ระดับ VIP นั้นๆแล้ว สมาชิกสามารถสมัครโบนัสฝากเงินเองได้ตามโปรโมชั่น การเลื่อนหรือลดระดับจะไม่เกี่ยวข้องกับโบนัสฝากเงินที่เคยได้สมัครมาแล้ว แนะนำ: VIP8 VIP9 และ VIP10 จะไม่ได้รับการเลื่อนระดับอัตโนมัติ ทางฝ่าย VIP จะเป็นฝ่ายตรวจสอบในแต่ละเดือน หากคุณสามารถผ่านข้อกำหนดใดๆ ทางฝ่าย VIP จะติดต่อสมาชิกเพื่อเลื่อนระดับไปในแต่ระดับ ไล่ตั้งแต่ VIP8 VIP9 และ VIP10'
        ]
    }, 
    {
        title: '',
        textWrap: [
            'เมื่อแรกเริ่มโปรแกรม VIP ที่ JBO สมาชิกทุกท่านจะได้รับคุณสมบัติเป็นสมาชิกระดับปกติ และสมาชิกใหม่ที่สมัครมาก็ยังคงต้องเริ่มจากสมาชิกระดับปกติเช่นกัน'
        ]
    },
    {
        title: '',
        textWrap: [
            'หากสมาชิกทำยอดฝากและยอดหมุนเวียนภายใน 30 วัน แถบเลื่อนระดับจะแสดงถึงยอดอีกเท่าไหร่ที่จะเลื่อนไปยังระดับถัดไป [VIP 4]'
        ]
    },
    {
        title: '',
        textWrap: [
            'JBO ขอสงวนสิทธิ์ในการแก้ไขและเปลี่ยนแปลงเงื่อนไข ของระบบ VIP โดยไม่ต้องแจ้งให้ทราบล่วงหน้า'
        ]
    },

    // {
    //     title: '晋升标准',
    //     textWrap: [
    //         '会员的30天累计存款以及30天累计流水达到相应级别的要求，即可在次日08:00前晋升至相应的VIP等级。',
    //         '（例子：今天3月14日，系统将计算29天前至今【2月13日至3月14日】的累积存款以及累积流水。）',
    //         'VIP8，VIP9，VIP10会员晋级将由升级审核部门于每月月底审核后，VIP专员将会在次月月初通知升级成功会员。'
    //     ]
    // },
    // {
    //     title: '晋升顺序',
    //     textWrap: [
    //         'VIP等级达到相应的要求时，即可每天晋升一级，但VIP等级不可越级晋升。',
    //         '注：系统将会根据当前的VIP等级计算和升级，若您提前完成条件次日会自动升级。保持等级将需要完成指定的等级要求。',
    //         '(例子：新注册会员A（11月2日），存款1,000บาท并完成有效流水6,000บาท。他已经达到VIP 3的条件，但是系统将会每日升一级（从VIP 1开始）而不会越级晋升至VIP 3。）'
    //     ]
    // },
    // {
    //     title: '保级要求',
    //     textWrap: [
    //         '会员在达到某VIP等级后，需要在30天内达到保级存款和流水要求。如果在此期间完成晋升，保级存款与流水的要求将重新按照当前 VIP等级计算。',
    //         '（例子：会员A从11月2日保持VIP 3，但是在保级的第29天，他荣升VIP 4。此时会员将会获得【升级礼金】，同时他需要从新开始完成30天的保级条件才可以获得VIP 4保级礼金。)'
    //     ]
    // },
    // {
    //     title: '降级标准',
    //     textWrap: [
    //         '如果会员在30天内没有完成相应的保级存款与流水要求，系统将会降级一个等级，相应的再存红利以及其他的优惠也会随之调整至降级后的等级。'
    //     ]
    // },
    // {
    //     title: '升级礼金',
    //     textWrap: [
    //         '升级礼金在会员达到该VIP等级后，系统将会在晋升当天的20:00前自动派发，每个VIP等级的升级礼金所有会员仅能获得1次。（升级礼金仅需1ครั้ง流水即可提款。）。VIP8，VIP9，VIP10会员升级彩金请与VIP专员连系登记后，统一派发'
    //     ]
    // },
    // {
    //     title: '保级礼金',
    //     textWrap: [
    //         '会员在30天内达到保级存款和流水要求后，系统将会在完整30天后的次日20: 00前自动派发相应的VIP等级保级礼金。如果他在30天内晋升，他只会获得升级礼金，并不会获得之前的级别保级礼金。（保级礼金仅需1ครั้ง流水即可提款。）。VIP8，VIP9，VIP10会员彩金，将由VIP专员登记后统一派发。'
    //     ]
    // },
    // {
    //     title: '再存红利',
    //     textWrap: [
    //         '会员在达到某VIP等级后，会依据相应级别的再存红利自助申请。升级或降级并不影响他之前所申请的再存红利。 注：VIP 8, VIP 9 和 VIP 10 的等级是不会自动晋升的。VIP专员将会在每个月底进行一次审核。如果会员成功通过审核，VIP专员将会联系会员，之后再将会员晋升到相应的VIP 8，VIP 9，VIP 10的等级。'
    //     ]
    // },
    // {
    //     title: '返水比例',
    //     textWrap: [
    //         '返水彩金将在结算次日 13:00 前派发。返水彩金将根据次日会员的VIP等级进行计算。'
    //     ]
    // },
    // {
    //     title: '',
    //     textWrap: [
    //         '当竞博VIP开始时，所有会员将会从普通会员级别开始。新注册会员也是从普通会员级别开始。'
    //     ]
    // },
    // {
    //     title: '',
    //     textWrap: [
    //         '如果会员在VIP 3的等级，那30天达累计存款金额和30天累计流水是显示升级VIP 4的要求和会员进度，30天达保级有效存款及流水则是显示保级VIP 3的要求和会员进度。'
    //     ]
    // },
    // {
    //     title: '',
    //     textWrap: [
    //         '竞博将保留对活动的修改，停止及最终解释权。'
    //     ]
    // },
]


export const VipReturnWaterData = [
    ['VIP 1', '0.20%', '0.10%', '0.12%', '0.40%'],
    ['VIP 2', '0.23%', '0.12%', '0.14%', '0.45%'],
    ['VIP 3', '0.26%', '0.14%', '0.16%', '0.50%'],
    ['VIP 4', '0.29%', '0.16%', '0.18%', '0.60%'],
    ['VIP 5', '0.32%', '0.18%', '0.20%', '0.70%'],
    ['VIP 6', '0.40%', '0.20%', '0.25%', '0.80%'],
    ['VIP 7', '0.45%', '0.22%', '0.30%', '0.90%'],
    ['VIP 8', '0.50%', '0.35%', '0.40%', '1.00%'],
    ['VIP 9', '0.60%', '0.40%', '0.45%', '1.10%'],
    ['VIP 10', '0.70%', '0.45%', '0.50%', '1.20%'],
]

export const VipReturnWaterData2 = [
    <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}>
        <Text style={styles.vipText222}>1. </Text></View><Text style={styles.vipText111}>คุณต้องทำยอดหมุนเวียนให้ครบภายใน 15 วันหลังจากการสมัคร</Text></View>,
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText222}>2. </Text>
        </View>
        <Text style={styles.vipText111}>ทุกคาสิโน เกม Bull Bull , แบล็คแจ็ค ,เสือมังกร และเกมตกปลา จะไม่นำมาคำนวณยอดหมุนเวียน</Text></View>,
    <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText222}>3. </Text></View><Text style={styles.vipText111}>เกม "Dancing Dragon" "Bikini Party" "Gem Reel" เกม 3 มิติ</Text></View>,
    <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText222}>4. </Text></View><Text style={styles.vipText111}>ในเกมการเดิมพันกีฬา และ อีสปอร์ต การเดิมพันแพ้ชนะเท่านั้นจะนับยอดหมุนเวียน หากผลการเดิมพัน เสมอ ยกเลิก หรือการเดิมพัน 2 ฝั่ง ที่อัตราต่อรอง DEC น้อยกว่า 1.7, HK น้อยกว่า 0.7 , MY น้อย กว่า 0.7, INDO น้อยกว่าหรือเท่ากับ -1.43 และ US น้อยกว่าหรือเท่ากับ -143 จะไม่นับเป็นยอดหมุนเวียน</Text></View>,
    <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text style={styles.vipText222}>5. </Text></View><Text style={styles.vipText111}>ในการเดิมพันกีฬา สำหรับชนะครึ่ง แพ้ครั้ง จะนับเพียงครึ่งเดียวของจำนวนเดิมพันเท่านั้น และข้อกำหนดนี้เป็นไปตามข้อกำหนดพื้นฐานสำหรับการแข่งขัน</Text></View>,
]

export const VipReturnWaterData4 = [
    <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}>
        <Text style={styles.vipText222}>1. </Text></View><Text
        style={styles.vipText111}>โบนัสเงินคืนจะปรับให้สมาชิกที่ผ่านคุณสมบัติโดยอัตโนมัติ</Text></View>,
    <View style={styles.vipTextBOx11}>
        <View style={styles.vipTextBOx22}>
            <Text style={styles.vipText222}>2. </Text>
        </View>
        <Text style={styles.vipText111}>โบนัสจะคำนวณจากยอดหมุนเวียนรายวันของสมาชิก โดยคำนวนจากยอดระหว่างเวลา 00:00 ถึง
            23:59 น. (GMT + 8) ตามเวลาเว็บไซต์</Text></View>,
    <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text
        style={styles.vipText222}>3. </Text></View><Text style={styles.vipText111}>โบนัสจะปรับจะให้ช่วงก่อน 14.00
        น.ของวันถัดไป โดยจะคำนวณยอดตามระดับของสมาชิก</Text></View>,
    <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text
        style={styles.vipText222}>4. </Text></View><Text style={styles.vipText111}>สมาชิกจะต้องมียอดหมุนเวียน 1
        เท่าของโบนัสที่ได้รับก่อนทำการถอนเงิน</Text></View>,
    <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text
        style={styles.vipText222}>5. </Text></View><Text style={styles.vipText111}>เงินคืนสำหรับเกมสล็อต และเกม 3
        มิติจะถูกคำนวณแยกกัน โดยพิจารณาจากยอดหมุนเวียนของแต่ละประเภท</Text></View>,
    <View style={styles.vipTextBOx11}><View style={styles.vipTextBOx22}><Text
        style={styles.vipText222}>6. </Text></View><Text style={styles.vipText111}>ในการเดิมพันกีฬา
        และอีสปอร์ตจะคำนวณจากการเดิมพันที่มีผลชนะ หรือแพ้เท่านั้น ทุกการเดิมพันที่มีผลเสมอ, ยกเลิก, โมฆะ, การเดิมพัน 2
        ฝั่ง และการเดิมพันที่มีอัตราต่อรองดังนี้ จะไม่นับรวมในยอดเดิมพันหมุนเวียนตามข้อตกลง: ราคา DEC น้อยกว่า 1.70,
        ราคา MY น้อยกว่า0.70, ราคา HK น้อยกว่า 0.70, ราคา INDO น้อยกว่า -1.43</Text></View>,
]

export const VipReturnWaterData3 = [
    [`ระดับ${'\n'}VIP`, 'อีสปอร์ต / กีฬา\n（รายวัน）', 'คาสิโนสด\n（รายวัน）', 'P2P\n（ต่อวัน）', 'สล็อต\n（ต่อวัน）'],
    ['VIP 1', '0.20%', '0.10%', '0.12%', '0.40%'],
    ['VIP 2', '0.23%', '0.12%', '0.14%', '0.45%'],
    ['VIP 3', '0.26%', '0.14%', '0.16%', '0.50%'],
    ['VIP 4', '0.29%', '0.16%', '0.18%', '0.60%'],
    ['VIP 5', '0.32%', '0.18%', '0.20%', '0.70%'],
    ['VIP 6', '0.40%', '0.20%', '0.25%', '0.80%'],
    ['VIP 7', '0.45%', '0.22%', '0.30%', '0.90%'],
    ['VIP 8', '0.50%', '0.35%', '0.40%', '1.00%'],
    ['VIP 9', '0.60%', '0.40%', '0.45%', '1.10%'],
    ['VIP 10', '0.70%', '0.45%', '0.50%', '1.20%'],
]
